Repository: steventsao/byot
Catalog: Sources/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Redo or send your revised prompt first.
zh_hans: 请先重做或发送修改后的提示词。

source: Redo the conversation before adding work to the computer queue.
zh_hans: 向电脑队列添加任务前，请先重做对话。

source: Redo turn
zh_hans: 重做轮次

source: Refresh
zh_hans: 刷新

source: Refresh the list to see the current changes.
zh_hans: 刷新列表以查看当前的更改。

source: Refreshing sessions
zh_hans: 正在刷新会话

source: Reject
zh_hans: 拒绝

source: Reload commands
zh_hans: 重新载入命令

source: Reload models
zh_hans: 重新载入模型

source: Remove
zh_hans: 移除

source: Remove %@
zh_hans: 移除“%@”

source: Remove attachments to run a shell command.
zh_hans: 请移除附件以运行 Shell 命令。

source: Remove queued message
zh_hans: 移除排队的消息

source: Remove server
zh_hans: 移除服务器

source: Remove server file %@
zh_hans: 移除服务器文件 %@

source: Remove this command and compose it again to change its arguments.
zh_hans: 要更改参数，请移除此命令并重新编写。

source: Remove this server?
zh_hans: 要移除此服务器吗？

# Removed line %@: %@%@
source: Removed line %1$@: %2$@%3$@
zh_hans: 删除第 %1$@ 行：%2$@%3$@

source: Rename
zh_hans: 重命名

source: Rename conversation
zh_hans: 重命名对话

source: Rename terminal
zh_hans: 重命名终端

source: Rename…
zh_hans: 重命名…

source: Renaming is unavailable on this server.
zh_hans: 此服务器不支持重命名。

source: Replaces every occurrence
zh_hans: 替换所有匹配项

source: Replies
zh_hans: 回复

source: Reply
zh_hans: 回复

source: Reply details
zh_hans: 回复详细信息

source: Request already handled
zh_hans: 请求已处理

source: Requested
zh_hans: 手动

source: Reset
zh_hans: 重置

source: Reset Worktree
zh_hans: 重置工作树

source: Reset to Default Branch…
zh_hans: 重置到默认分支…

source: Reset to default branch
zh_hans: 重置到默认分支

source: Reset worktree?
zh_hans: 要重置工作树吗？

source: Reset “%@”?
zh_hans: 要重置“%@”吗？

# Resets %@ to match %@.
source: Resets %1$@ to match %2$@.
zh_hans: 将 %1$@ 重置为与 %2$@ 一致。

source: Resets the worktree to match %@.
zh_hans: 将工作树重置为与 %@ 一致。

source: Resetting…
zh_hans: 正在重置…

source: Response needed
zh_hans: 需要回应

source: Response required
zh_hans: 需要回应

source: Response text
zh_hans: 回复文本

source: Result
zh_hans: 结果

source: Resume queue
zh_hans: 恢复队列

source: Retried after an error
zh_hans: 出错后已重试

source: Retried after an error · attempt %lld
zh_hans: 出错后已重试 · 第 %lld 次尝试

source: Retried after an error, attempt %lld
zh_hans: 出错后已重试，第 %lld 次尝试

source: Retry
zh_hans: 重试

source: Retry %lld
zh_hans: 第 %lld 次重试

source: Retry last message
zh_hans: 重试最后一条消息

source: Retrying
zh_hans: 正在重试

source: Retrying · attempt %lld
zh_hans: 正在重试 · 第 %lld 次尝试

source: Returns to messages.
zh_hans: 返回消息。

source: Review
zh_hans: 查看

source: Review changes
zh_hans: 查看更改

source: Review files changed in this session
zh_hans: 查看此会话中更改的文件

source: Review in byot
zh_hans: 在 byot 中查看

source: Reviewing repository metadata before making changes.
zh_hans: 正在更改前查看仓库元数据。

source: Right arrow
zh_hans: 右箭头

source: Run again
zh_hans: 再次运行

source: Run command
zh_hans: 运行命令

source: Run it on the computer with your OpenCode server, using the address your iPhone reaches. It reads OPENCODE_SERVER_PASSWORD, and the code contains that password, so don’t share it.
zh_hans: 在运行 OpenCode 服务器的电脑上运行它，并使用 iPhone 能访问的地址。它会读取 OPENCODE_SERVER_PASSWORD，而配对码中包含该密码，因此请勿分享。

source: Run this command again?
zh_hans: 要再次运行此命令吗？

source: Running
zh_hans: 运行中

source: Running on computer
zh_hans: 正在电脑上运行

source: Running sessions and anything that needs you will show up here.
zh_hans: 正在运行的会话和需要你处理的事项将显示在这里。

source: Runs commands on the server instead of messaging the agent.
zh_hans: 在服务器上运行命令，而不是向智能体发送消息。

source: Runs in %@
zh_hans: 在 %@ 中运行

# Runs in %@ on %@
source: Runs in %1$@ on %2$@
zh_hans: 在 %2$@ 上的 %1$@ 中运行

source: SIL Open Font License 1.1
zh_hans: SIL 开放字体许可证 1.1

source: Save
zh_hans: 存储

source: Save and reload
zh_hans: 存储并重新载入

source: Save server settings?
zh_hans: 要存储服务器设置吗？

source: Saved for byot
zh_hans: 已为 byot 保存

source: Saved on this iPhone
zh_hans: 已保存在此 iPhone 上

source: Saving
zh_hans: 正在存储

source: Saving pauses the queue. Resume it when your edits are ready.
zh_hans: 存储会暂停队列。编辑完成后请恢复队列。

source: Saving server
zh_hans: 正在存储服务器

source: Say “Ask OpenCode in byot” to start a session, or “What needs me in byot” to hear which sessions are waiting on you. byot’s actions are also in the Shortcuts app.
zh_hans: 说“在 byot 中询问 OpenCode”来开始会话，或说“byot 里有什么需要我处理”来了解哪些会话在等你。你也可以在“快捷指令”App 中找到 byot 的操作。

source: Scan pairing code
zh_hans: 扫描配对码

source: Scan the pairing code from your computer, find OpenCode on this network, or enter its HTTPS address.
zh_hans: 扫描电脑上的配对码、在此网络中查找 OpenCode，或输入其 HTTPS 地址。

source: Search
zh_hans: 搜索

source: Search Sessions
zh_hans: 搜索会话

source: Search again
zh_hans: 再次搜索

source: Search files
zh_hans: 搜索文件

source: Search models
zh_hans: 搜索模型

source: Search or type provider/model
zh_hans: 搜索或输入 提供商/模型

source: Search project files
zh_hans: 搜索项目文件

source: Search sessions or projects
zh_hans: 搜索会话或项目

source: Searching this network for OpenCode servers.
zh_hans: 正在此网络中搜索 OpenCode 服务器。

source: Secrets such as API keys, tokens, headers and environment values are hidden.
zh_hans: API 密钥、令牌、请求头和环境变量值等机密信息已隐藏。

source: See which OpenCode sessions need you and how many are running.
zh_hans: 查看哪些 OpenCode 会话需要你处理，以及有多少正在运行。

source: Select code
zh_hans: 选择代码

source: Select text
zh_hans: 选择文本

source: Selected
zh_hans: 已选择

source: Selected project
zh_hans: 所选项目

source: Selected server
zh_hans: 所选服务器

source: Selection fixture
zh_hans: 选择测试数据

source: Send
zh_hans: 发送

source: Send Message
zh_hans: 发送消息

source: Send a prompt first. Changes appear here after OpenCode edits files.
zh_hans: 请先发送提示词。OpenCode 编辑文件后，更改会显示在这里。

source: Send fixture context
zh_hans: 发送测试上下文

source: Send message
zh_hans: 发送消息

source: Send or remove the existing local queued messages first.
zh_hans: 请先发送或移除本地已排队的消息。

source: Send test notification
zh_hans: 发送测试通知

source: Send to byot
zh_hans: 发送到 byot

source: Sent to the %@ agent
zh_hans: 已发送给 %@ 智能体

# Sent. OpenCode is working in %@ on %@.
source: Sent. OpenCode is working in %1$@ on %2$@.
zh_hans: 已发送。OpenCode 正在 %2$@ 上的 %1$@ 中工作。

source: Server
zh_hans: 服务器

# Server %@, project %@
source: Server %1$@, project %2$@
zh_hans: 服务器 %1$@，项目 %2$@

source: Server Files
zh_hans: 服务器文件

source: Server command
zh_hans: 服务器命令

source: Server default
zh_hans: 服务器默认

source: Server details
zh_hans: 服务器详细信息

source: Server file acceptance
zh_hans: 服务器文件验收

source: Server files
zh_hans: 服务器文件

source: Server password
zh_hans: 服务器密码

source: Server settings
zh_hans: 服务器设置

source: Server settings saved
zh_hans: 服务器设置已存储

source: Server skill
zh_hans: 服务器技能

source: Servers
zh_hans: 服务器

source: Session
zh_hans: 会话

source: Session ID
zh_hans: 会话 ID

source: Session actions
zh_hans: 会话操作

source: Session details
zh_hans: 会话详细信息

source: Session ended
zh_hans: 会话已结束

source: Session in %@
zh_hans: %@ 中的会话

source: Session list options
zh_hans: 会话列表选项

source: Session status
zh_hans: 会话状态

source: Session totals
zh_hans: 会话总计

source: Sessions
zh_hans: 会话

source: Sessions this conversation started with the task tool. They keep their own transcripts and totals.
zh_hans: 此对话通过任务工具启动的会话。它们各自保留自己的对话记录和总计。

source: Sessions you start here or in OpenCode on this server appear here.
zh_hans: 在这里或在此服务器的 OpenCode 中开始的会话会显示在这里。

source: Set up AGENTS.md
zh_hans: 设置 AGENTS.md

source: Set up AGENTS.md…
zh_hans: 设置 AGENTS.md…

source: Set up notifications
zh_hans: 设置通知

source: Set up or update companion
zh_hans: 设置或更新配套程序

source: Set up the computer companion in this server’s Notifications settings first.
zh_hans: 请先在此服务器的“通知”设置中设置电脑端配套程序。

source: Settings unavailable
zh_hans: 设置不可用

source: Setup & support
zh_hans: 设置与支持

source: Share
zh_hans: 分享

source: Share Markdown file
zh_hans: 分享 Markdown 文件

source: Share link
zh_hans: 分享链接

source: Shared to byot
zh_hans: 已分享到 byot

source: Sharing
zh_hans: 分享

source: Sharing %@
zh_hans: 正在分享%@

source: Sharing is turned off in this server’s OpenCode config.
zh_hans: 此服务器的 OpenCode 配置中已关闭分享。

source: Sharing unavailable
zh_hans: 无法分享

source: Shell command
zh_hans: Shell 命令

source: Shell command, %@
zh_hans: Shell 命令，%@

source: Shell commands run while OpenCode is idle. Stop the turn or wait for it to finish.
zh_hans: Shell 命令会在 OpenCode 空闲时运行。请停止该轮次或等待其完成。

source: Shell mode
zh_hans: Shell 模式

source: Shell mode. Commands run on the server.
zh_hans: Shell 模式。命令将在服务器上运行。

source: Show %lld unchanged lines
zh_hans: 显示 %lld 行未更改的内容

source: Show 1 unchanged line
zh_hans: 显示 1 行未更改的内容

source: Show all %lld lines
zh_hans: 显示全部 %lld 行

source: Show all lines
zh_hans: 显示所有行

source: Show keyboard
zh_hans: 显示键盘

source: Show less
zh_hans: 收起

source: Show the status of
zh_hans: 查看以下项目的状态

source: Showing %@
zh_hans: 正在显示%@

# Showing %@ %@.
source: Showing %1$@ %2$@.
zh_hans: 正在显示%2$@%1$@。

source: Showing the beginning. The file and the copy include the whole conversation.
zh_hans: 仅显示开头部分。文件和拷贝的内容包含完整对话。

source: Shows MCP servers, language servers and settings for %@
zh_hans: 显示 %@ 的 MCP 服务器、语言服务器和设置

source: Shows the available agents.
zh_hans: 显示可用的智能体。

source: Shows the project’s status
zh_hans: 显示项目状态

source: Shows the public link.
zh_hans: 显示公开链接。

source: Shows this file’s changes
zh_hans: 显示此文件的更改

source: Shows this terminal
zh_hans: 显示此终端

source: Shows token use and cost for this session
zh_hans: 显示此会话的 token 用量和费用

source: Sign in on the server’s computer with “opencode mcp auth %@”.
zh_hans: 请在服务器所在的电脑上使用“opencode mcp auth %@”登录。

source: Simulate notification
zh_hans: 模拟通知

source: Siri & Shortcuts
zh_hans: Siri 与快捷指令

source: Slash
zh_hans: 斜杠

source: Small model
zh_hans: 小模型

source: Smaller text
zh_hans: 较小文字

source: Snapshots
zh_hans: 快照

source: Snapshots let you undo and revert the agent’s file changes.
zh_hans: 快照让你可以撤销和还原智能体对文件的更改。

source: Solar Icons by 480 Design
zh_hans: Solar Icons，由 480 Design 设计

source: Some OpenCode actions could not be refreshed: %@
zh_hans: 部分 OpenCode 操作无法刷新：%@

source: Something went wrong.
zh_hans: 出现问题。

source: Sort projects
zh_hans: 项目排序

source: Sort sessions
zh_hans: 会话排序

source: Speak to add words to your message.
zh_hans: 说话即可将内容添加到你的消息中。

source: Speech recognition isn’t available right now. Check your connection and try again.
zh_hans: 语音识别目前不可用。请检查你的网络连接，然后重试。

source: Speech recognition or the microphone is restricted on this device.
zh_hans: 此设备上的语音识别或麦克风受到限制。

source: Start
zh_hans: 开始

source: Start a conversation
zh_hans: 开始对话

source: Start session
zh_hans: 开始会话

source: Starting
zh_hans: 正在启动

source: Starting on computer
zh_hans: 正在电脑上启动

source: Starting session…
zh_hans: 正在启动会话…

source: Starting…
zh_hans: 正在启动…

source: Starts a new OpenCode session and sends it your prompt. Uses the model and agent you last picked on that server.
zh_hans: 开始新的 OpenCode 会话并发送你的提示词。将使用你上次在该服务器上选择的模型和智能体。

source: State
zh_hans: 状态目录

source: Status
zh_hans: 状态

source: Status of %@
zh_hans: %@ 的状态

source: Status unavailable
zh_hans: 状态不可用

source: Status unavailable: %@
zh_hans: 状态不可用：%@

source: Stays on this device
zh_hans: 保留在此设备上

source: Step
zh_hans: 步骤

source: Stop
zh_hans: 停止

source: Stop Turn
zh_hans: 停止本轮

source: Stop dictation
zh_hans: 停止听写

source: Stop subagent
zh_hans: 停止子智能体

source: Stop the current turn
zh_hans: 停止当前轮次

source: Stop the current turn before changing its history.
zh_hans: 更改历史记录前，请先停止当前轮次。

source: Stop the current turn before deleting.
zh_hans: 删除前请先停止当前轮次。

source: Stopped
zh_hans: 已停止

source: Stopped at the output limit
zh_hans: 因达到输出上限而停止

source: Stopped by the content filter
zh_hans: 被内容过滤器停止

source: Subagent
zh_hans: 子智能体

source: Subagent sessions are unavailable on this server.
zh_hans: 此服务器不支持子智能体会话。

source: Subagent task
zh_hans: 子智能体任务

source: Subagents
zh_hans: 子智能体

source: Subagents take their instructions from the main session.
zh_hans: 子智能体从主会话接收指令。

source: Submit answers
zh_hans: 提交答案

source: Subtask
zh_hans: 子任务

source: Summary
zh_hans: 摘要

source: Switched to %@
zh_hans: 已切换到 %@

source: Switched to model %@
zh_hans: 已切换到模型 %@

source: Switched to the %@ agent
zh_hans: 已切换到 %@ 智能体

source: Switches to %@.
zh_hans: 切换到 %@。

source: Switching a server applies until OpenCode restarts. Its configuration is unchanged.
zh_hans: 切换服务器的设置在 OpenCode 重新启动前有效，其配置不会更改。

source: Sync again
zh_hans: 重新同步

source: System
zh_hans: 跟随系统

source: System follows your iPhone’s Light or Dark Mode setting.
zh_hans: “跟随系统”会沿用 iPhone 的浅色或深色模式设置。

source: Table
zh_hans: 表格

source: Tap a line, then another line to select a range.
zh_hans: 轻点一行，再轻点另一行以选择范围。

source: Task progress unavailable
zh_hans: 任务进度不可用

source: Tasks
zh_hans: 任务

source: Tell OpenCode what to do.
zh_hans: 告诉 OpenCode 要做什么。

source: Terminal
zh_hans: 终端

source: Terminal actions
zh_hans: 终端操作

source: Terminal in %@
zh_hans: %@ 中的终端

source: Terminal unavailable
zh_hans: 终端不可用

source: Test connection
zh_hans: 测试连接

source: Test notification sent to Apple.
zh_hans: 测试通知已发送到 Apple。

source: Text size
zh_hans: 文字大小

source: That photo couldn’t be opened. Try another one.
zh_hans: 无法打开该照片。请换一张试试。

source: That project is on a different server. Choose the server again.
zh_hans: 该项目位于其他服务器上。请重新选择服务器。

source: That prompt is too long to send from Siri. Open byot to send it.
zh_hans: 该提示词太长，无法通过 Siri 发送。请打开 byot 发送。

source: That server was removed from byot. Add it again, then try again.
zh_hans: 该服务器已从 byot 中移除。请重新添加，然后重试。

source: The OpenCode event endpoint did not return an event stream.
zh_hans: OpenCode 事件端点未返回事件流。

source: The OpenCode event stream fell behind and will reconnect.
zh_hans: OpenCode 事件流已落后，将重新连接。

source: The OpenCode event stream sent a line larger than the %@-byte safety limit.
zh_hans: OpenCode 事件流发送的某一行超过了 %@ 字节的安全上限。

source: The OpenCode event stream sent a record larger than the %@-byte safety limit.
zh_hans: OpenCode 事件流发送的某条记录超过了 %@ 字节的安全上限。

source: The OpenCode server returned an empty response.
zh_hans: OpenCode 服务器返回了空响应。

source: The OpenCode server returned an invalid response.
zh_hans: OpenCode 服务器返回了无效的响应。

source: The answer is too long.
zh_hans: 答案太长。

source: The answer is too short.
zh_hans: 答案太短。

source: The attachment couldn’t be read.
zh_hans: 无法读取该附件。

source: The command may have run before the connection failed. Review the session before choosing Run again. %@
zh_hans: 命令可能在连接中断前已运行。选择“再次运行”前，请先查看会话。%@

source: The companion must keep running on your computer. Setup can install a background service on macOS.
zh_hans: 配套程序必须在你的电脑上持续运行。设置过程可以在 macOS 上安装后台服务。

source: The connection ended before OpenCode confirmed the result, so the command may have run. Check the conversation before running it again. %@
zh_hans: 连接在 OpenCode 确认结果前中断，因此命令可能已运行。再次运行前请先检查对话。%@

source: The connection ended before execution could be confirmed. Review the conversation, dismiss this item, and compose a new message only if needed. Later messages remain blocked until you dismiss it.
zh_hans: 连接在确认执行前中断。请查看对话并关闭此项，仅在需要时编写新消息。在你关闭此项之前，后续消息将保持阻止状态。

source: The last turn failed.
zh_hans: 上一轮失败。

source: The latest reply’s input, output, reasoning and cached tokens, measured against the model’s context window.
zh_hans: 最新回复的输入、输出、推理和缓存 token，相对于模型上下文窗口的占用。

source: The link stops working for everyone who has it. Publishing again creates a new link.
zh_hans: 所有拥有该链接的人都将无法再使用它。重新发布会创建新链接。

source: The model’s reasoning before each reply
zh_hans: 模型在每条回复前的推理过程

source: The number exceeds the maximum.
zh_hans: 数字超过最大值。

source: The number is below the minimum.
zh_hans: 数字低于最小值。

source: The queue changed or this message already started. Refresh before changing it.
zh_hans: 队列已更改或此消息已开始。更改前请先刷新。

source: The queue returned an invalid response.
zh_hans: 队列返回了无效的响应。

source: The request failed.
zh_hans: 请求失败。

source: The rule is kept in memory while this OpenCode instance remains active and is not persisted.
zh_hans: 在此 OpenCode 实例保持活跃期间，该规则保存在内存中，不会持久保存。

source: The saved password and the sessions kept for offline viewing will also be deleted from this iPhone.
zh_hans: 已存储的密码和为离线查看而保留的会话也会从此 iPhone 中删除。

source: The saved queue needs recovery before it can be changed.
zh_hans: 已保存的队列需要恢复后才能更改。

source: The saved rule applies across project sessions and server restarts until removed. Configured deny rules still take precedence.
zh_hans: 保存的规则适用于项目的所有会话，服务器重新启动后仍然有效，直至被移除。已配置的拒绝规则仍然优先。

source: The saved server has changed or was removed. Open Notifications on the correct server to pair it again.
zh_hans: 已存储的服务器已更改或被移除。请在正确的服务器上打开“通知”以重新配对。

source: The saved server has changed or was removed. Open byot to review it.
zh_hans: 已存储的服务器已更改或被移除。请打开 byot 查看。

source: The selected model is no longer available.
zh_hans: 所选模型已不再可用。

source: The selected model no longer advertises that variant. Choose Default or refresh models.
zh_hans: 所选模型已不再提供该变体。请选择“默认”或刷新模型。

source: The server address in this pairing code isn’t a complete HTTPS URL.
zh_hans: 此配对码中的服务器地址不是完整的 HTTPS URL。

source: The server answered for a different project. Refresh and try again.
zh_hans: 服务器返回的是其他项目的结果。请刷新后重试。

source: The server may already have run this command. Review the session first to avoid repeating its effects.
zh_hans: 服务器可能已运行过此命令。请先查看会话，以免重复执行其效果。

source: The server opened the terminal in a different project. Close it and try again.
zh_hans: 服务器在其他项目中打开了终端。请关闭后重试。

source: The server profile and password were left unchanged.
zh_hans: 服务器配置和密码未更改。

source: The server refused the terminal connection. Check its CORS and authentication settings.
zh_hans: 服务器拒绝了终端连接。请检查其 CORS 和身份验证设置。

source: The server rejected the terminal credentials. Check the password for this server.
zh_hans: 服务器拒绝了终端凭证。请检查此服务器的密码。

source: The server returned changes for a different project. Refresh the session and try again.
zh_hans: 服务器返回了其他项目的更改。请刷新会话后重试。

source: The server returned files from a different project or workspace. Refresh the session before choosing context.
zh_hans: 服务器返回了其他项目或工作区的文件。选择上下文前请先刷新会话。

source: The server’s model catalog doesn’t list a context size for this model.
zh_hans: 服务器的模型目录未列出此模型的上下文大小。

source: The session became active before this message was sent. Its selections are saved; retry when the current turn finishes.
zh_hans: 此消息发送前会话已变为活跃状态。其选择已保存；请在当前轮次结束后重试。

source: The shell and anything running in it will stop.
zh_hans: Shell 及其中正在运行的所有内容都将停止。

source: The shell runs the agent’s commands and terminals. Leave it empty to use the login shell.
zh_hans: Shell 用于运行智能体的命令和终端。留空则使用登录 Shell。

source: The small model writes session titles and summaries. Automatic lets OpenCode choose.
zh_hans: 小模型用于生成会话标题和摘要。“自动”由 OpenCode 选择。

source: The turn failed.
zh_hans: 本轮失败。

source: There’s nothing here byot can send.
zh_hans: 这里没有 byot 可以发送的内容。

source: Thinking
zh_hans: 正在思考

source: This OpenCode 2 server does not provide file changes yet.
zh_hans: 此 OpenCode 2 服务器尚不提供文件更改。

source: This OpenCode 2 server doesn’t provide terminals yet.
zh_hans: 此 OpenCode 2 服务器尚不提供终端。

source: This OpenCode 2 server exposes an unsupported prompt API. Update the server or byot.
zh_hans: 此 OpenCode 2 服务器提供了不受支持的提示词 API。请更新服务器或 byot。

source: This OpenCode server doesn’t let apps change its settings.
zh_hans: 此 OpenCode 服务器不允许 App 更改其设置。

source: This OpenCode server doesn’t manage worktrees.
zh_hans: 此 OpenCode 服务器不管理工作树。

source: This OpenCode server doesn’t provide terminals.
zh_hans: 此 OpenCode 服务器不提供终端。

source: This OpenCode server doesn’t provide this information.
zh_hans: 此 OpenCode 服务器不提供此信息。

source: This OpenCode server doesn’t report project status yet.
zh_hans: 此 OpenCode 服务器尚不报告项目状态。

source: This OpenCode server doesn’t support shell commands.
zh_hans: 此 OpenCode 服务器不支持 Shell 命令。

source: This OpenCode server version is not supported.
zh_hans: 不支持此 OpenCode 服务器版本。

source: This OpenCode version isn’t supported.
zh_hans: 不支持此 OpenCode 版本。

source: This field requires a newer byot version.
zh_hans: 此字段需要更新版本的 byot。

source: This file context belongs to a different server or workspace. Remove it and select the file again.
zh_hans: 此文件上下文属于其他服务器或工作区。请将其移除，然后重新选择文件。

source: This file is too large to preview on your phone. You can still add the file as context.
zh_hans: 此文件太大，无法在手机上预览。你仍然可以将其添加为上下文。

source: This image couldn’t be displayed.
zh_hans: 无法显示此图像。

source: This isn’t a byot pairing code. Show the code from byot-pair-qr.sh, or an HTTPS server address.
zh_hans: 这不是 byot 配对码。请显示 byot-pair-qr.sh 生成的配对码或 HTTPS 服务器地址。

source: This message belongs to a previous server pairing. Cancel it and compose it again.
zh_hans: 此消息属于之前的服务器配对。请取消它并重新编写。

source: This message belongs to another queue.
zh_hans: 此消息属于另一个队列。

source: This message has already started and can’t be edited.
zh_hans: 此消息已开始，无法编辑。

source: This message is too large to queue.
zh_hans: 此消息太大，无法排队。

source: This notification can’t be opened. Open the session from your server instead.
zh_hans: 无法打开此通知。请改为从你的服务器打开该会话。

source: This pairing code doesn’t include a server address.
zh_hans: 此配对码不包含服务器地址。

source: This pairing code needs a newer version of byot.
zh_hans: 此配对码需要更新版本的 byot。

source: This project’s config starts sessions with the %@ agent.
zh_hans: 此项目的配置使用 %@ 智能体开始会话。

source: This project’s config uses %@ as its model.
zh_hans: 此项目的配置使用 %@ 作为模型。

source: This project’s config uses %@ as its small model.
zh_hans: 此项目的配置使用 %@ 作为小模型。

source: This queue has 20 pending messages. Wait or remove one before adding another.
zh_hans: 此队列已有 20 条待处理的消息。请等待或移除一条后再添加。

source: This queued message changed on the computer. Refresh before editing it.
zh_hans: 这条排队的消息已在电脑上更改。编辑前请先刷新。

source: This removes the conversation from the server. It cannot be undone.
zh_hans: 这会将对话从服务器中移除。此操作无法撤销。

source: This request can’t be remembered.
zh_hans: 无法记住此请求。

source: This request is no longer waiting for a response.
zh_hans: 此请求已不再等待回应。

source: This request needs a response in the app.
zh_hans: 此请求需要在 App 中回应。

source: This saves %1$@ requests matching: %2$@ in this OpenCode project. The rule applies across project sessions and server restarts until removed from saved permissions. Configured deny rules still take precedence.
zh_hans: 这会在此 OpenCode 项目中保存匹配以下内容的 %1$@ 请求：%2$@。该规则适用于项目的所有会话，服务器重新启动后仍然有效，直至从已保存的权限中移除。已配置的拒绝规则仍然优先。

source: This saves every %@ request in this OpenCode project. The rule applies across project sessions and server restarts until removed from saved permissions. Configured deny rules still take precedence.
zh_hans: 这会在此 OpenCode 项目中保存所有 %@ 请求。该规则适用于项目的所有会话，服务器重新启动后仍然有效，直至从已保存的权限中移除。已配置的拒绝规则仍然优先。

source: This server can’t open subagent sessions.
zh_hans: 此服务器无法打开子智能体会话。

source: This server can’t publish sessions on the web.
zh_hans: 此服务器无法将会话发布到网页。

source: This server does not accept file references in prompts.
zh_hans: 此服务器不接受提示词中的文件引用。

source: This server does not offer AGENTS.md setup.
zh_hans: 此服务器不提供 AGENTS.md 设置。

source: This server does not provide %@ changes.
zh_hans: 此服务器不提供“%@”更改。

source: This server does not provide %@.
zh_hans: 此服务器不提供%@。

source: This server does not provide a task snapshot. Tasks appear here if it reports live task updates.
zh_hans: 此服务器不提供任务快照。如果它报告实时任务更新，任务会显示在这里。

source: This server does not provide changes for an individual session.
zh_hans: 此服务器不提供单个会话的更改。

source: This server does not provide file changes for review.
zh_hans: 此服务器不提供可供查看的文件更改。

source: This server does not report provider connection status.
zh_hans: 此服务器不报告提供商的连接状态。

source: This server does not support changing the primary agent.
zh_hans: 此服务器不支持更改主要智能体。

source: This server does not support sending this kind of input.
zh_hans: 此服务器不支持发送此类输入。

source: This server does not support slash skill attachments.
zh_hans: 此服务器不支持斜杠技能附件。

source: This server does not support this action.
zh_hans: 此服务器不支持此操作。

source: This server exposes an unsupported command or prompt shape.
zh_hans: 此服务器提供了不受支持的命令或提示词格式。
